api/app/controllers/opportunities_controller.rb

  def index
    opportunities = if params[:query].present?
      Opportunity.fuzzy_search(params[:query])
    else
      Opportunity.includes(:patient, :doctor)
---
SELECT "opportunities".* FROM "opportunities"

  def create
    @opportunity = Opportunity.new(opportunity_params)

    if @opportunity.save
---
INSERT INTO "opportunities" ("procedure_name", "patient_id", "doctor_id", "stage_history", "created_at", "updated_at", "stage") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"